<!-- Эталонный компонент‑гайд по оформлению компонентов в проекте -->

<!-- Чеклист
  1. Перед началом разработки любого компонента (страница тоже компонент)
     - чекнуть его дизайн на мобилке
     - чекнуть дизайн где он используется или может использоваться
     - чекнуть данные, которые он использует (апи/пропсы)
     - пофантазировать как он может масштабироваться в будущем,
       и если не заложить основу под масштабирование, то хотя бы это масштабированию не навредить 🤓
     ⚠️ После этого уже принять решение по структуре и логике
  2. Создать пропсы
  3. Сетевой запрос, если требуется, или импорт иных данных
  4. Создать эмиты
  5. Верстка темплейта
     - расставляем пропсы
     - асинхронные данные
     - создаем computed'ы
     - вешаем события
  6. Создаем обработчики событий и действия
     - Обрабатываем события (типа клики и т.д.)
     - Описываем побочные actions (например: запросы к апи, при удалении/добавлении чего-либо)
  7. Стилизация
  8. Тыкаем-смотрим, что вышло – вносим правки

  ❇️ Коротко резюмируя: сначала все изучаем, потом все данные собираем, потом их размещаем, потом ими манипулируем, а после стилизуем

  Так реально получается быстрее процентов на 30% делать компонент,
  меньше допускать в процессе логических ошибок, и тратить времени на их исправление

  Если будут какие-то предложения, особенно полученные опытным путем – пишите
-->

<!--
  Сначала — блок <script> с lang="ts" и директивой setup
-->
<script lang="ts" setup>
// Сначала импорты типов
import type { AsyncDataRequestStatus } from '#app'

// Затем прочие импорты
// Помним: в Nuxt многое автоимпортируется
import app from '~/app.vue'

// Далее — типы пропсов
interface Props {
  status: AsyncDataRequestStatus
  type: Type
  // Используем этот пропс когда компyент значительно видоизменяется
  // Например: кнопка solid    – залитая цветом
  //                  bordered - кнопка с бордером
  // Такой же методики придерживается Nuxt UI, можно посмотреть, чтобы понять
  variant: ''
}

// Затем — типы событий (emits)
interface Emits {
  callback: [Option]
}

// Прочие служебные типы
type Option = [Props['status'], Model]
type Model = number
type Type = 'root' | 'instance'

// Далее — все composables (включая проектные); исключение — хуки, запускающие побочные эффекты (например, useAsyncData)
const { versions } = useNuxtApp()

// Пропсы
// Если не используем их в <script>, объявляем без присваивания переменной
const props = defineProps<Props>()

// Эмиты
// Если не используем их в <script>, объявляем без присваивания переменной
defineEmits<Emits>()

// Да, порядок тот же, что и в Options API :)

// Независимо от контекста модель называем "model"
const model = defineModel<Model>({ default: 200 })

// Прочие реактивные переменные

// Нереактивные значения
// Подсказка: поставь курсор в кавычки и нажми Option+Esc (mac) / Ctrl+Space (win) — типизация наше всё
// Так же если навоить на тип с зажатым commnad/ctrl - видим подробную типизацию
const option: Option = ['', 200]

// Вычисляемые свойства
// Всегда фиксируем классы‑состояния и навешиваем их на корневой элемент шаблона
const classname = computed(() => [
  'world',
  `world-status-${props.status}`,
  `world-type-${props.type}`,
])
const statusText = computed<string>(() => model.value === 200 ? 'Успех' : 'Не успех')
const startUpText = computed(() => props.status === 'idle' ? 'Не начинали' : 'Уже начали')

// Сетевые запросы — здесь
// useAsyncData()

// ℹ️ Если в какой‑то момент кажется, что логика перемешалась — раздели компонент на два (это нормально)

// Наблюдатели (watch)
watch(model, value => option[1] = value)

// События жизненного цикла
onMounted(() => {
  console.log(versions, ': mounted')
})

// Методы (обработчики событий)
const onClick = () => {
  new app()
}
const deleteWorld = () => {
  // @ts-expect-error: ignore example code
  // eslint-disable-next-line no-delete-var
  delete app
}
</script>

<template>
  <div :class="classname">
    <h1>Hello, World</h1>
    <p>{{ statusText }}</p>
    <p>{{ startUpText }}</p>
    <!--
      Всегда выносим обработчики в <script>.
      ⚠️ Здесь — никаких вычислений и условной логики.
      Допустимо только менять значение переменной,
      например, с true на false, с «открыть» на «закрыть».

      Классы именуем по методологии БЭМ.
    -->
    <button
      class="world__action world__button world__button-hello"
      @click="onClick"
    >
      Привет
    </button>
    <button
      class="world__action world__button world__button-delete"
      @click="deleteWorld"
    >
      Удалить
    </button>
    <!-- Слот всегда оборачиваем -->
    <div class="world__slot">
      <slot />
    </div>
  </div>
</template>

<!-- Только SCSS -->
<style lang="scss">
.world {
  $this: &;

  // Состояния компонента, навешанные на корневой элемент
  $status-idle: $this + '-status-idle';
  $status-pending: $this + '-status-pending';
  $type-root: $this + '-type-root';
  $type-instance: $this + '-type-instance';

  &__button {
    // Используем как модификаторы — почти БЭМ
    // ⬇️ Здесь: Если состояние компонента pending — кнопка недоступна для событий
    #{$status-pending} & {
      pointer-events: none;
    }
  }
}
</style>
